<template>
	<div class="main-page">
		<h1 class="text-left">ARTICLES</h1>
		<ArticlesList :articles="articles"></ArticlesList>
	</div>
</template>

<script>
	import ArticlesList from "@/widgets/ArticlesList";

	export default {
		name: 'Main',

		components: {
			ArticlesList
		},

		data() {
			return {
				articles: [
					{
						id: 1,
						title: 'В Слуге народа намерены упростить выборы с открытыми списками',
						text: 'Процедуру голосования по открытым спискам необходимо упростить, чтобы она стала более понятной, заявил первый замглавы фракции Слуга народа Александр Корниенко в интервью Левому берегу. "У меня много вопросов к этой процедуре (голосованию по открытым спискам - ред.). Не думаю, что мы будем радикально эту систему менять. Но ее точно нужно упрощать, чтобы она стала более понятной", - сказал Корниенко. Также он сообщил, что положения Избирательного кодекса, которые не соответствуют внесенным в Конституцию изменениям, будут пересмотрены.',
						created: '10/10/2019'
					},
					{
						id: 2,
						title: 'РФ должна быть готова пойти навстречу и прекратить войну в Украине, – Тони Блэр',
						text: '“Другой мирный процесс – когда страна, например, стала жертвой неспровоцированной агрессии. То есть, например, я залезу к вам в дом, свяжу вас и скажу: “Слушайте, я вас отпущу, но возьму телевизор и мебель”. Если кто-то скажет, что это хороший компромисс, то если вы сейчас развязаны и можете нормально передвигаться, то это не совсем хорошее решение”, – пояснил Блэр.',
						created: '12/10/2019'
					},
					{
						id: 3,
						title: 'Квасьневский предостерег Зеленского от преследования Порошенко',
						text: '"Не может быть политических решений, нам надо сейчас этого посадить, потому что это людям понравится. Это плохо. Если Порошенко что-то сделал некорректное, это суды, этим вопросом должны заниматься они, без президента, без политического фактора. Если он будет делать, что хочет, потому что это реванш или потому что это понравится его избирателям, это будет плохо не только для Порошенко, это будет плохо прежде всего для Зеленского, потому что пострадает его имидж молодого человека, который смотрит в будущее, который хочет творить современную демократическую страну", – считает польский экс-президент.',
						created: '09/09/2019'
					}
				]
			}
		},
	}
</script>

<style lang="scss" scoped>

</style>